README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cours de classification non supervisée</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Roland Donat" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://roland-donat.github.io/ubs/Charte_graphique/IUT/ubs_iut_vannes.css" />
</head>
<body>
<div id="content">
<h1 class="title">Cours de classification non supervisée</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0cc2790">1. Introduction</a></li>
<li><a href="#orgaf9f306">2. Objectifs Pédagogiques</a></li>
<li><a href="#orge7c83fc">3. Crédit</a></li>
<li><a href="#org2ded7bc">4. Organisation pratique</a></li>
<li><a href="#org1d92539">5. Cours</a>
<ul>
<li><a href="#org8cb2b3f">5.1. Semaine 1 : Introduction et notions fondamentales</a></li>
</ul>
</li>
<li><a href="#orgf881ad5">6. Évaluation du cours</a></li>
<li><a href="#org8d6b126">7. Références</a>
<ul>
<li><a href="#org8cd3632">7.1. L'environnement <code>Python</code></a></li>
<li><a href="#org8477d09">7.2. Principaux modules <code>Python</code> utilisés</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0cc2790" class="outline-2">
<h2 id="org0cc2790"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Ce site présente l'ensemble des ressources pédagogiques relatives au cours de classification non
supervisée pour la promotion de STID2 à l'IUT de Vannes.
</p>
</div>
</div>

<div id="outline-container-orgaf9f306" class="outline-2">
<h2 id="orgaf9f306"><span class="section-number-2">2</span> Objectifs Pédagogiques</h2>
<div class="outline-text-2" id="text-2">
<p>
Les principaux objectifs pédagogiques du cours sont :
</p>
<ul class="org-ul">
<li>Comprendre la problématique de classification non supervisée.</li>
<li>Replacer cette problématique dans le contexte méthodologique de l'analyse de données.</li>
<li>Introduire la notion d'inertie et son utilisation.</li>
<li>Présenter différentes approches de classification non supervisée pour l'analyse des données
quantitatives, à savoir les méthodes de partitionnement et les méthodes de construction d'arbres hiérarchiques
le modèle de mélange gaussien.</li>
<li>Savoir mettre en oeuvre ces méthodes avec la langage <code>Python</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orge7c83fc" class="outline-2">
<h2 id="orge7c83fc"><span class="section-number-2">3</span> Crédit</h2>
<div class="outline-text-2" id="text-3">
<p>
Les cours et TD proposés s'inspirent largement des supports pédagogiques élaborées par Mme. Arlette
ANTONI qui avait en charge le cours de classification non supervisée sur l'année 2019-2020. Vous
pouvez consulter ces ressources pédagogiques en vous rendant dans <a href="https://moodle.univ-ubs.fr/course/view.php?id=3596">l'espace <i>Clustering</i> sur Moodle</a>.
</p>
</div>
</div>
