README.org
* Organisation pratique

Compte tenu du contexte sanitaire actuel, les cours et TD sont prévus pour se tenir en 100%
distanciel. Mais nous ne sommes pas à l'abri de changements de dernières minutes, restez donc sur
vos gardes...

Pour suivre les cours, les TD et avoir de passionnants débats sur la classification non supervisée, merci de
faire une demande d'inscription à l'équipe Teams [[https://teams.microsoft.com/l/team/19%3a541fb9397ced490aab1776de0de9202f%40thread.tacv2/conversations?groupId=775ce021-bec5-4bc8-9892-4854cd178be3&tenantId=2fbd12a9-cbb9-49a2-9612-7af4096a6529][STID2 - Classification non
supervisée]].

* Cours

Les supports de cours sont disponibles en ligne sous forme de présentation HTML (une connexion internet est
donc requise).

*Note : Il est recommandé d'utiliser le navigateur =Firefox= pour visualiser les slides de cours.*

** Cours 1 : introduction générale

- [[https://roland-donat.github.io/cours-class-non-sup/cours/C1%20-%20Introduction%20g%C3%A9n%C3%A9rale/c1_intro.html][Slides HTML]]
- Scripts =Python= : à venir

* Travaux dirigés

** TD1 : distance et inertie 

- Sujet de TD
- Scripts =Python= : à venir

* Évaluation du cours

L'objectif est d'évaluer votre compréhension des notions et méthodes abordées en cours et
en TD. Pour ce faire, nous vérifierons votre aptitude à mettre en oeuvre les traitements
informatiques adéquats face à une problématique de classification non supervisée. Les évaluations se
présenteront sous la forme de quiz sur la plateforme Moodle. 

Planning des évaluations (à venir)


* Références

L'élaboration de ce cours s'est appuyée sur de nombreuses références. Voici mes principales sources
d'inspiration :
- [[http://www2.agroparistech.fr/IMG/pdf/ClassificationNonSupervisee-AgroParisTech.pdf][Cours de classification non supervisée]] de E. Lebarbier, T. Mary-Huard (Agro ParisTech).
- [[https://www.math.univ-toulouse.fr/~besse/Wikistat/pdf/st-m-explo-classif.pdf][Cours de classification non supervisée]] de Philippe Besse (INSA de Toulouse).
- [[http://www.math.u-bordeaux.fr/~mchave100p/wordpress/wp-content/uploads/2013/10/cours_classif_quanti.pdf][Cours de classification automatique de données quantitatives]] de Marie Chavent (Université de Bordeaux).
- [[https://www.youtube.com/watch?v=SE_4dLh5vXY][Série de vidéos sur la classification non supervisée]] de François Husson (Agrocampus Rennes).
- [[https://educlust.dbvis.de][Plateforme =EduClust=]] de l'Universität Konstanz qui permet de expérimenter certains algorithmes de
  /clustering/ et visualiser les résultats.

** L'environnement =Python=
Les exemples du cours et les travaux dirigés utilisent le logiciel =Python=. Si vous pensez ne pas
être à l'aise avec =Python=, je vous encourage vivement à faire une petite mise à niveau.

Il existe énormément de très bon didacticiels sur internet qui traitent de l'apprentissage de ce
langage en statistiques. À titre indicatif, je vous ai mis à disposition une série de TD sur
=Python= dans l'[[https://teams.microsoft.com/_#/school/files/G%C3%A9n%C3%A9ral?threadId=19%3A541fb9397ced490aab1776de0de9202f%40thread.tacv2&ctx=channel&context=Python%2520-%2520les%2520bases&rootfolder=%252Fsites%252FSTID2-Classificationnonsupervise%252FSupports%2520de%2520cours%252FPython%2520-%2520les%2520bases][équipe Teams du cours]]. Ces TD reprennent la base de la base sur le langage
=Python=. Autrement dit, si vous avez déjà programmé, vous risquez de vous ennuyer. Vous pouvez
toujours jeter un oeil aux TD6, TD7 et TD8 qui portent sur le traitement des données.

Par ailleurs, si vous disposez d'une connexion internet fiable, je vous recommande d'utiliser une
plateforme de /Notebooks/ en ligne telle que [[https://deepnote.com][=DeepNote=]]. L'inscription est gratuite et évite de
devoir gérer l'installation de l'environnement =Python= sur votre poste. 
Sinon vous pouvez bien évidement utiliser =Python= en local en installant la distribution
[[https://www.anaconda.com/products/individual][=Anaconda=]]. 

*L'important est de vous assurer que vous utilisez bien la version =3.8= ou supérieure de =Python=.*

