README.html

<div id="outline-container-org2ded7bc" class="outline-2">
<h2 id="org2ded7bc"><span class="section-number-2">4</span> Organisation pratique</h2>
<div class="outline-text-2" id="text-4">
<p>
Compte tenu du contexte sanitaire actuel, les cours et TD sont prévus pour se tenir en 100%
distanciel. Mais nous ne sommes pas à l'abri de changements de dernières minutes, restez donc sur
vos gardes&#x2026;
</p>

<p>
Pour suivre les cours, les TD et avoir de passionnants débats sur la classification non supervisée, merci de
faire une demande d'inscription à l'équipe Teams <a href="https://teams.microsoft.com/l/team/19%3a541fb9397ced490aab1776de0de9202f%40thread.tacv2/conversations?groupId=775ce021-bec5-4bc8-9892-4854cd178be3&amp;tenantId=2fbd12a9-cbb9-49a2-9612-7af4096a6529">STID2 - Classification non
supervisée</a>.
</p>
</div>
</div>

<div id="outline-container-org1d92539" class="outline-2">
<h2 id="org1d92539"><span class="section-number-2">5</span> Cours</h2>
<div class="outline-text-2" id="text-5">
<p>
Les supports de cours sont disponibles en ligne sous forme de présentation HTML (une connexion internet est
donc requise).
</p>

<p>
<b>Note : Il est recommandé d'utiliser le navigateur <code>Firefox</code> pour visualiser les slides de cours.</b>
</p>
</div>

<div id="outline-container-org8cb2b3f" class="outline-3">
<h3 id="org8cb2b3f"><span class="section-number-3">5.1</span> Semaine 1 : Introduction et notions fondamentales</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>Cours :</b>
</p>
<ul class="org-ul">
<li><a href="https://roland-donat.github.io/cours-class-non-sup/cours/C1%20-%20Introduction%20g%C3%A9n%C3%A9rale/c1_intro.html">Slides du cours HTML</a></li>
<li><a href="https://github.com/roland-donat/cours-class-non-sup/tree/main/cours/C1%20-%20Introduction%20g%C3%A9n%C3%A9rale">Scripts <code>Python</code> du cours</a></li>
</ul>

<p>
Note : pour reproduire les exemples du cours, n'oubliez pas de télécharger le module <a href="https://github.com/roland-donat/cours-class-non-sup/tree/main/python"><code>clust_util.py</code></a>
en le plaçant dans le même répertoire que les scripts.
</p>

<p>
<b>TD :</b>
</p>
<ul class="org-ul">
<li><a href="https://roland-donat.github.io/cours-class-non-sup/td/td1/td1.html">Sujet du TD</a></li>
<li>Scripts <code>Python</code> : à venir</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf881ad5" class="outline-2">
<h2 id="orgf881ad5"><span class="section-number-2">6</span> Évaluation du cours</h2>
<div class="outline-text-2" id="text-6">
<p>
L'objectif est d'évaluer votre compréhension des notions et méthodes abordées en cours et
en TD. Pour ce faire, nous vérifierons votre aptitude à mettre en oeuvre les traitements
informatiques adéquats face à une problématique de classification non supervisée. Les évaluations se
présenteront sous la forme de quiz sur la plateforme Moodle. 
</p>

<p>
Planning des évaluations (à venir)
</p>
</div>
</div>


<div id="outline-container-org8d6b126" class="outline-2">
<h2 id="org8d6b126"><span class="section-number-2">7</span> Références</h2>
<div class="outline-text-2" id="text-7">
<p>
L'élaboration de ce cours s'est appuyée sur de nombreuses références. Voici mes principales sources
d'inspiration :
</p>
<ul class="org-ul">
<li><a href="http://www2.agroparistech.fr/IMG/pdf/ClassificationNonSupervisee-AgroParisTech.pdf">Cours de classification non supervisée</a> de E. Lebarbier, T. Mary-Huard (Agro ParisTech).</li>
<li><a href="https://www.math.univ-toulouse.fr/~besse/Wikistat/pdf/st-m-explo-classif.pdf">Cours de classification non supervisée</a> de Philippe Besse (INSA de Toulouse).</li>
<li><a href="http://www.math.u-bordeaux.fr/~mchave100p/wordpress/wp-content/uploads/2013/10/cours_classif_quanti.pdf">Cours de classification automatique de données quantitatives</a> de Marie Chavent (Université de Bordeaux).</li>
<li><a href="https://www.youtube.com/watch?v=SE_4dLh5vXY">Série de vidéos sur la classification non supervisée</a> de François Husson (Agrocampus Rennes).</li>
<li><a href="https://educlust.dbvis.de">Plateforme <code>EduClust</code></a> de l'Universität Konstanz qui permet de expérimenter certains algorithmes de
<i>clustering</i> et visualiser les résultats.</li>
</ul>
</div>

<div id="outline-container-org8cd3632" class="outline-3">
<h3 id="org8cd3632"><span class="section-number-3">7.1</span> L'environnement <code>Python</code></h3>
<div class="outline-text-3" id="text-7-1">
<p>
Les exemples du cours et les travaux dirigés utilisent le logiciel <code>Python</code>. Si vous pensez ne pas
être à l'aise avec <code>Python</code>, je vous encourage vivement à faire une petite mise à niveau.
</p>

<p>
Il existe énormément de très bon didacticiels sur internet qui traitent de l'apprentissage de ce
langage en statistiques. À titre indicatif, je vous ai mis à disposition une série de TD sur
<code>Python</code> dans l'<a href="https://teams.microsoft.com/_#/school/files/G%C3%A9n%C3%A9ral?threadId=19%3A541fb9397ced490aab1776de0de9202f%40thread.tacv2&amp;ctx=channel&amp;context=Python%2520-%2520les%2520bases&amp;rootfolder=%252Fsites%252FSTID2-Classificationnonsupervise%252FSupports%2520de%2520cours%252FPython%2520-%2520les%2520bases">équipe Teams du cours</a>. Ces TD reprennent la base de la base sur le langage
<code>Python</code>. Autrement dit, si vous avez déjà programmé, vous risquez de vous ennuyer. Vous pouvez
toujours jeter un oeil aux TD6, TD7 et TD8 qui portent sur le traitement des données.
</p>

<p>
Par ailleurs, si vous disposez d'une connexion internet fiable, je vous recommande d'utiliser une
plateforme de <i>Notebooks</i> en ligne telle que <a href="https://deepnote.com"><code>DeepNote</code></a>. L'inscription est gratuite et évite de
devoir gérer l'installation de l'environnement <code>Python</code> sur votre poste. 
Sinon vous pouvez bien évidement utiliser <code>Python</code> en local en installant la distribution
<a href="https://www.anaconda.com/products/individual"><code>Anaconda</code></a>. 
</p>

<p>
<b>L'important est de vous assurer que vous utilisez bien la version <code>3.8</code> ou supérieure de <code>Python</code>.</b>
</p>
</div>
</div>
