README.org
** Principaux modules =Python= utilisés

Dans ce cours, nous utiliserons principalement les modules =Python= suivants :
- =pandas=, pour la manipulation des données ;
- =plotly=, pour les représentations graphiques ;
- =numpy=, pour utiliser des fonctions de calculs numériques "bas niveau", e.g. génération de
  nombres aléatoires ;
- =scipy=, pour utiliser d'autres fonctions de calculs numériques plus "haut niveau", e.g. calcul de
  distances ;
- =sklearn=, pour avoir accès aux algorithmes de classification.

Ces modules ne seront pas forcément installés par défaut dans votre environnement logiciel. Si vous
utilisez un /notebook/ (local ou distant de type =Deepnote=), vous pouvez utiliser la commande =!pip
install <nom_module>= pour les installer : 
#+attr_latex: :options bgcolor=almostwhite, frame=lines
#+BEGIN_SRC python :results silent :exports code
!pip install pandas
!pip install plotly
!pip install scipy
!pip install sklearn
#+END_SRC
 
Vous pourrez ainsi les importer dans vos scripts de la manière suivante :
#+attr_latex: :options bgcolor=almostwhite, frame=lines
#+BEGIN_SRC python :session :tangle td1.py :results silent :exports code
import pandas as pd
import numpy as np
import plotly.express as px
from scipy.spatial.distance import pdist, cdist, squareform
#+END_SRC


