README.html

<div id="outline-container-org8477d09" class="outline-3">
<h3 id="org8477d09"><span class="section-number-3">7.2</span> Principaux modules <code>Python</code> utilisés</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Dans ce cours, nous utiliserons principalement les modules <code>Python</code> suivants :
</p>
<ul class="org-ul">
<li><code>pandas</code>, pour la manipulation des données ;</li>
<li><code>plotly</code>, pour les représentations graphiques ;</li>
<li><code>numpy</code>, pour utiliser des fonctions de calculs numériques "bas niveau", e.g. génération de
nombres aléatoires ;</li>
<li><code>scipy</code>, pour utiliser d'autres fonctions de calculs numériques plus "haut niveau", e.g. calcul de
distances ;</li>
<li><code>sklearn</code>, pour avoir accès aux algorithmes de classification.</li>
</ul>

<p>
Ces modules ne seront pas forcément installés par défaut dans votre environnement logiciel. Si vous
utilisez un <i>notebook</i> (local ou distant de type <code>Deepnote</code>), vous pouvez utiliser la commande <code>!pip
install &lt;nom_module&gt;</code> pour les installer : 
</p>
<div class="org-src-container">
<pre class="src src-python">!pip install pandas
!pip install plotly
!pip install scipy
!pip install sklearn
</pre>
</div>

<p>
Vous pourrez ainsi les importer dans vos scripts de la manière suivante :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> pandas <span style="color: #F0DFAF; font-weight: bold;">as</span> pd
<span style="color: #F0DFAF; font-weight: bold;">import</span> numpy <span style="color: #F0DFAF; font-weight: bold;">as</span> np
<span style="color: #F0DFAF; font-weight: bold;">import</span> plotly.express <span style="color: #F0DFAF; font-weight: bold;">as</span> px
<span style="color: #F0DFAF; font-weight: bold;">from</span> scipy.spatial.distance <span style="color: #F0DFAF; font-weight: bold;">import</span> pdist, cdist, squareform
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
